** Wrangling of Datablocks

In [1]:
import pandas as pd

In [3]:
DBs = pd.read_csv('../../data/raw/DBs.csv')
DBs = DBs[['DBUID','CMANAME','DBPOP','lat','lon']]
DBs = DBs.rename(columns = {'DBUID':'id', 'CMANAME':'metropolitan_area', 'DBPOP':'pop'})

DBs

                 id metropolitan_area  pop      lat      lon
0       10010165001        St. John's  160  47.5300 -52.7765
1       10010165002        St. John's   25  47.5290 -52.7793
2       10010165006        St. John's  268  47.5265 -52.7768
3       10010165007        St. John's   53  47.5263 -52.7726
4       10010166001        St. John's   71  47.5268 -52.7730
...             ...               ...  ...      ...      ...
489671  62080028007               NaN  112  68.6235 -95.8734
489672  62080028008               NaN    0  68.6232 -95.8756
489673  62080028009               NaN   75  68.6230 -95.8369
489674  62080028010               NaN   47  68.6151 -95.8479
489675  62080028011               NaN   39  68.6204 -95.8743

[489676 rows x 5 columns]

In [7]:
DBsVan = DBs[DBs['metropolitan_area'] == 'Vancouver']
DBsVan = DBsVan.drop(columns='metropolitan_area')

DBsVan

                 id  pop      lat       lon
442430  59150004004   35  49.3739 -123.2738
442431  59150004005   50  49.3746 -123.2757
442432  59150004006   94  49.3738 -123.2763
442433  59150004011    0  49.3735 -123.2725
442434  59150004012    0  49.3725 -123.2729
...             ...  ...      ...       ...
457622  59154055002    0  49.0044 -122.4774
457623  59154055003    0  49.0036 -122.4762
457624  59154055004  386  49.0029 -122.4757
457625  59154055005    0  49.0062 -122.4772
457626  59154056001   85  49.0053 -122.4748

[15197 rows x 4 columns]

In [14]:
DBsVan.to_csv('../../data/clean/vancouver_db.csv', index=False)